УправлениеАвтомастерской/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>EnumRef.Должности</types>
    </type>
  </attributes>
</mdclass:Catalog>

УправлениеАвтомастерской/src/Enums/Должности/Должности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Должности</name>
  <enumValues>
    <name>АдминистраторСистемы</name>
  </enumValues>
  <enumValues>
    <name>АдминистраторМастерской</name>
  </enumValues>
  <enumValues>
    <name>Мастер</name>
  </enumValues>
  <enumValues>
    <name>Руководитель</name>
  </enumValues>
</mdclass:Enum>

УправлениеАвтомастерской/src/Catalogs/Сотрудники/Forms/ФормаЭлемента85/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПрочитатьПользователяИБ(ТекущийОбъект);
	
	ПрочитатьНастройкиИнтерфейсаПользователяИБ();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПользователяИБ(ТекущийОбъект);
	
	ЗаписатьНастройкиИнтерфейсаПользователяИБ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	ПарольИзменен = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьПользователяИБ(ТекущийОбъект)
	
	ПользовательИБ = Неопределено;
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		ПользовательИБ = 
			ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено И Не ВходРазрешен Тогда
		Возврат;
	КонецЕсли;
	
	Если ПользовательИБ = Неопределено Тогда
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	КонецЕсли;
	
	ПользовательИБ.ПолноеИмя = ТекущийОбъект.Наименование;
	ПользовательИБ.Имя = Логин;
	ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
	
	Если ПарольИзменен Тогда
		ПользовательИБ.Пароль = Пароль;
	КонецЕсли;
	
	ПользовательИБ.Роли.Очистить();
	
	Если ТекущийОбъект.Должность = Перечисления.Должности.АдминистраторСистемы Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	КонецЕсли;
	
	Если ТекущийОбъект.Должность = Перечисления.Должности.АдминистраторМастерской Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.АдминистраторМастерской);
	КонецЕсли;
	
	Если ТекущийОбъект.Должность = Перечисления.Должности.Мастер Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Мастер);
	КонецЕсли;
	
	Если ТекущийОбъект.Должность = Перечисления.Должности.Руководитель Тогда
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Руководитель);
	КонецЕсли;
	
	ПользовательИБ.Записать();
	
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;	
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьПользователяИБ(ТекущийОбъект)
	
	Если Не ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		Возврат;
	КонецЕсли;
	
	ПользовательИБ = 
		ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ТекущийОбъект.ИдентификаторПользователяИБ);
		
	Если ПользовательИБ = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Логин = ПользовательИБ.Имя;
	ВходРазрешен = ПользовательИБ.АутентификацияСтандартная;
	
	ПарольИзменен = Ложь;
	Если ПользовательИБ.ПарольУстановлен Тогда
		Пароль = Новый УникальныйИдентификатор();
	Иначе
		Пароль = "";
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНастройкиИнтерфейсаПользователяИБ()
	
	Если Не ЗначениеЗаполнено(Логин) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиКлиентскогоПриложения = 
		ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения",,, Логин);
	
	Если НастройкиКлиентскогоПриложения = Неопределено Тогда
		НастройкиКлиентскогоПриложения = Новый НастройкиКлиентскогоПриложения();
	КонецЕсли;
	
	Если Не ПустаяСтрока(ВерсияИнтерфейса) Тогда
		НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения =
			ВариантИнтерфейсаКлиентскогоПриложения[ВерсияИнтерфейса];
	КонецЕсли;
	
	Если Не ПустаяСтрока(Тема) Тогда
		НастройкиКлиентскогоПриложения.ТемаКлиентскогоПриложения =
			ТемаКлиентскогоПриложения[Тема];
	КонецЕсли;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",, 
		НастройкиКлиентскогоПриложения,, Логин);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьНастройкиИнтерфейсаПользователяИБ()
	
	НастройкиКлиентскогоПриложения = 
		ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения",,, Логин);
	
	Если НастройкиКлиентскогоПриложения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Тема = Строка(НастройкиКлиентскогоПриложения.ТемаКлиентскогоПриложения);
	
	Если НастройкиКлиентскогоПриложения.ВариантИнтерфейсаКлиентскогоПриложения = 
		ВариантИнтерфейсаКлиентскогоПриложения.Такси Тогда		
		ВерсияИнтерфейса = "Такси";
	Иначе
		ВерсияИнтерфейса = "Версия8_5";
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
